In [59]:
# libraries
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import pandas as pd
from openpyxl import load_workbook

In [61]:
input_file_name_bicicletas = "bicicletas.xlsx"
input_sheet_name_bicicletas = "bicicletas"

In [68]:
input_file_name_subte = "subte.xlsx"
input_sheet_name_subte = "subte"

In [62]:
input_file_name_vehiculos = "vehiculos.xlsx"
input_sheet_name_vehiculos = "vehiculos"

In [63]:
df_bicicletas = pd.read_excel(input_file_name_bicicletas, sheet_name = input_sheet_name_bicicletas)

In [69]:
df_subte = pd.read_excel(input_file_name_subte, sheet_name = input_sheet_name_subte)

In [64]:
df_vehiculos = pd.read_excel(input_file_name_vehiculos, sheet_name = input_sheet_name_vehiculos)

In [71]:
df = df_bicicletas.merge(df_subte, how = 'right', on=['AÑO_MES'])
df

    AÑO_MES  BICICLETAS     SUBTE
0    202001    159233.0  14431260
1    202002    116965.0  14379523
2    202003     52951.0  16665570
3    202004         NaN   2532868
4    202005     20235.0   2769479
5    202006     69707.0   3566230
6    202007     98328.0   3417198
7    202008    248180.0   3122951
8    202009    273719.0   3629713
9    202010    323130.0   4966696
10   202011    332410.0   3768015
11   202012    308087.0   4255468

In [72]:
df = df.merge(df_vehiculos, how = 'right', on=['AÑO_MES'])
df

    AÑO_MES  BICICLETAS       SUBTE  VEHICULOS
0    202001    159233.0  14431260.0     248546
1    202002    116965.0  14379523.0     232209
2    202003     52951.0  16665570.0     197980
3    202004         NaN   2532868.0     143191
4    202005     20235.0   2769479.0     171215
5    202006     69707.0   3566230.0     212227
6    202007     98328.0   3417198.0     209202
7    202008    248180.0   3122951.0     213511
8    202009    273719.0   3629713.0     219852
9    202010    323130.0   4966696.0     226641
10   202011    332410.0   3768015.0     222866
11   202012    308087.0   4255468.0     236303
12   202101         NaN         NaN     236469
13   202102         NaN         NaN     210109
14   202103         NaN         NaN     241040
15   202104         NaN         NaN     221312
16   202105         NaN         NaN     210541
17   202106         NaN         NaN     216614
18   202107         NaN         NaN     236267
19   202108         NaN         NaN     237357